# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'emacs-plus'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'there'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-ibm-plex'
cask 'font-inconsolata'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Things', id: 904280696
mas 'Cyberduck', id: 409222199
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Calcbot', id: 931657367
mas '1Password 7', id: 1333542190
mas 'GarageBand', id: 682658836
mas 'Be Focused Pro', id: 961632517
mas 'Paste', id: 967805235
mas 'WhatsApp', id: 1147396723
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Fantastical', id: 975937182
mas 'Annotate', id: 918207447
mas 'iMovie', id: 408981434
mas 'ReadKit', id: 588726889
mas 'Noizio', id: 928871589
mas 'Next Meeting', id: 1017470484
mas 'Slack', id: 803453959
